// const user = {
//   name: 'Alice',
//   age: 20,
//   hobby: 'html',
//   premium: true,
// };
// user.mood = 'happy';
// user.hobby = 'skydiving';
// user.premium = false;
// console.log(user);
// const keys = Object.keys(user);
// --------------------------------------------------------------
// Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.
// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).
// let admin;
// let name;

// name = 'Іван';
// admin = name;
// console.log(admin);
// ---------------------------------------------------------------------------------------------
// Придумайте правильні імена
// важливість: 3
// Створіть змінну із назвою нашої планети. Як би ви назвали таку змінну?
// Створіть змінну для зберігання імені поточного відвідувача сайту. Як би ви назвали таку змінну?
// let ourPlanetName = 'Земля';
// let currentUserName = 'Іван';
// ------------------------------------------------------------------------------------------------
// Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’

// Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”
// let company = prompt('Яка “офіційна” назва JavaScript?', '');

// if (company == 'ECMAScript') {
//   alert('Правильно!');
// } else {
//   alert('Ви не знаєте? ECMAScript!');
// }
// ------------------------------II variant----------------------------------------------
// let company = prompt('Яка “офіційна” назва JavaScript?', '');

// if (company === 'ECMAScript') {
//   console.log('Правильно!');
// } else {
//   console.log('Ви не знаєте? ECMAScript!');
// }
// ------------------------------------------------------------------------------------------------
// Використовуючи if..else, напишіть код, що отримує число за допомогою prompt
// і потім виводить повідомлення alert:

// 1, якщо значення більше нуля,
// -1, якщо менше нуля,
// 0, якщо дорівнює нулю.

// let namber = prompt('Введіть число', 0);
// if (namber > 0) {
//   alert(1);
// } else if (namber < 0) {
//   alert(-1);
// } else {
//   alert(0);
// }
// ------------------------------------------------------------------------------------------------
// Перепишіть конструкцію if, використовуючи умовний оператор '?':

// let result;

// if (a + b < 4) {
//   result = 'Нижче';
// } else {
//   result = 'Вище';
// }

// let result = (a + b < 4) ? 'Нижче' : 'Вище';
// -------------------------------------------------------------------------------------------------
// Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
// Для зручності читання рекомендується розділити код на кілька рядків.

// let message;
// if (login == 'Працівник') {
//   message = 'Привіт';
// } else if (login == 'Директор') {
//   message = 'Вітаю';
// } else if (login == '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// let message =
//   login == 'Працівник'
//     ? 'Привіт'
//     : login == 'Директор'
//     ? 'Вітаю'
//     : login == ''
//     ? 'Немає логіну'
//     : '';
// ----------------------------------------------------------------------------
// Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.
// “Включно” означає, що age може досягати країв 14 або 90
// let age = 18;

// if (age >= 14 && age <= 90) {
//   alert(true);
// } else {
//   alert(false);
// }

// ---------------------тернарний оператор-------------------------------------
// let age = 18;
// let ageVallid = age >= 14 && age <= 90 ? true : false;
// console.log(ageVallid);
// -------------------------------------------------------------------------------
// Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно.

// Створіть два варіанти: перший з оператором НЕ !, другий — без нього.
// let age = 89;

// if (age >= 14 && age <= 90) {
//   alert(!true);
// } else {
//   alert(!false);
// }

// let age = 89;

// if (!(age >= 14 && age <= 90)) {
//   alert(true);
// } else {
//   alert(false);
// }
// --------------------------без І-------------------------------------------
// let age = 12;

// if (age >= 14 && age <= 90) {
//   alert(false);
// } else {
//   alert(true);
// }

// let age = 12;

// if (age < 14 || age > 90) {
//   alert(true);
// } else {
//   alert(false);
// }
// ----------------------------------------------------------------------------
// Напишіть код, який запитує логін за допомогою prompt.

// Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль.
//  Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”.
//   Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.

// Пароль перевіряється наступним чином:

// Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// Інший рядок – покажіть “Неправильний пароль”,
// Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
// Схема:

// Будь ласка, використовуйте вкладені if блоки. Потурбуйтесь про загальну читабельність коду.

// Підказка: передача порожнього вводу до запиту повертає порожній рядок ''.
//  Натискання ESC протягом запиту повертає null.

// let login = prompt('Введіть логін:');

// if (login === 'Admin') {
//   let password = prompt('Введіть пароль:');

//   if (password === 'Господар') {
//     message = 'Ласкаво просимо!';
//   } else if (password === null || password === '') {
//     message = 'Скасовано';
//   } else {
//     message = 'Неправильний пароль';
//   }
// } else if (login === null || login === '') {
//   message = 'Скасовано';
// } else {
//   message = 'Я вас не знаю';
// }

// console.log(message);
// ----------------------- З алертом------------------------------------------
// let userName = prompt('Хто там?', '');

// if (userName === 'Admin') {
//   let pass = prompt('Пароль?', '');

//   if (pass === 'Господар') {
//     alert('Ласкаво просимо!');
//   } else if (pass === '' || pass === null) {
//     alert('Скасовано');
//   } else {
//     alert('Неправильний пароль');
//   }
// } else if (userName === '' || userName === null) {
//   alert('Скасовано');
// } else {
//   alert('Я вас не знаю');
// }
// ---------------------------------------------------------------------------
// Виведіть парні числа від 2 до 10, використовуючи цикл for.
// for (let i = 0; i < 20; i++) {
//   if (i % 2) {
//     alert(i);
//   }
// }
// -----------------------------------------------------------------------------
// Виведіть непарні числа від 2 до 10, використовуючи цикл for.
// for (let i = 0; i < 20; i++) {
//   if !(i % 2) {
//     alert(i);
//   }
// }
// ---------------------------------------------------------------------------------
// Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).

// for (let i = 0; i < 3; i++) {
//   alert(`число ${i}!`);
// }

// let i = 0;
// while (i < 3) {
//   alert(`число ${i}!`);
//   i++;
// }
// ----------------------------------------------------------------------------
// Напишіть цикл, який пропонує prompt ввести число більше за 100.
// Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.

// Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід / введе порожній рядок.

// Ми припускаємо, що відвідувач вводитиме лише числа.
// В цьому завданні не обов’язково реалізовувати оброблення нечислового введення.

// let number;

// do {
//   number = prompt('Введіть число більше за 100:');
// } while (number !== null && number !== '' && Number(number) <= 100);

// if (number === null || number === '') {
//   console.log('Введення скасовано або порожній рядок.');
// } else {
//   console.log('Ви ввели число:', number);
// }
// -----------------------підручник---------------------
// let num;

// do {
//   num = prompt('Введене число, більше за 100?', 0);
// } while (num <= 100 && num);
// ---------------------відредактований джеміні підручник------------------
// let num;

// do {
//   num = prompt('Введене число, більше за 100?', 0);
//   num = Number(num); // Явне перетворення в число
// } while (num !== null && num !== '' && num <= 100);

// if (num === null) {
//   console.log('Введення скасовано');
// } else if (num === '') {
//   console.log('Ви ввели порожній рядок');
// } else {
//   console.log('Дякуємо, ви ввели число:', num);
// }
// -----------------------------------------------------------------------
// Вивести прості числа
// Просте число – це натуральне число, яке має два дільники (1 і саме число).

// Інакше кажучи, n > 1 – просте, якщо воно більше за 1 і ділиться без остачі на 1 та n.

// Наприклад, число 5 – просте, тому що воно не ділиться без остачі на 2, 3 і 4.
//  Воно ділиться без остачі лише на 1 і на 5.

// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.

// Для n = 10 результат повинен бути 2,3,5,7.

// P.S. Код також повинен легко модифікуватися для будь-якого числа n.

// let n = 10;

// nextPrime: for (let i = 2; i <= n; i++) {
//   // для кожного i...

//   for (let j = 2; j < i; j++) {
//     // шукаємо дільник..
//     if (i % j == 0) continue nextPrime; // не просте, беремо наступне i
//   }

//   alert(i); // просте число
// }
// ----------------------------------------------------------------------------
// Перепишіть конструкцію "switch" в аналогічну з використанням "if"
// важливість: 5
// Напишіть код з використанням if..else, що відповідає наступній конструкції switch:

// switch (browser) {
//   case 'Edge':
//     alert( "You've got the Edge!" );
//     break;

//   case 'Chrome':
//   case 'Firefox':
//   case 'Safari':
//   case 'Opera':
//     alert( 'Ми підтримуємо і ці браузери' );
//     break;

//   default:
//     alert( 'Маємо надію, що ця сторінка виглядає добре!' );
// }

// let browser = 'Edge';

// if (browser == 'Edge') {
//   alert("You've got the Edge!");
// } else if (
//   browser == 'Chrome' ||
//   browser == 'Firefox' ||
//   browser == 'Safari' ||
//   browser == 'Opera'
// ) {
//   alert('Ми підтримуємо і ці браузери');
// } else {
//   alert('Маємо надію, що ця сторінка виглядає добре!');
// }
// -------------------------------------------------------------------
// Перепишіть умови "if" в конструкцію "switch"
// важливість: 4
// Перепишіть код нижче використовуючи одну конструкцію switch:

// let a = +prompt('a?', '');

// if (a == 0) {
//   alert( 0 );
// }
// if (a == 1) {
//   alert( 1 );
// }

// if (a == 2 || a == 3) {
//   alert( '2,3' );
// }

// let a = +prompt('a?', '');
// switch (a) {
//   case 0:
//     alert(0);
//     break;
//   case 1:
//     alert(1);
//     break;
//   case 2:
//   case 3:
//     alert('2,3');
//     break;
//   default:
//     break;
// }
// ----------------------------------------------------------------------------------
